In [1]:
import pandas as pd

In [2]:
obj = pd.Series([1,3,5,7])
print(obj)

0    1
1    3
2    5
3    7
dtype: int64

In [4]:
obj.values

array([1, 3, 5, 7], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([1,3,5,7],index=['a','b','c','d'])
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
obj2['a']

1

In [11]:
obj[[True,False,True,True]]

0    1
2    5
3    7
dtype: int64

In [13]:
obj2[['b','c','d','a']]

b    3
c    5
d    7
a    1
dtype: int64

In [14]:
obj2*2

a     2
b     6
c    10
d    14
dtype: int64

In [15]:
sdata = {'lizhi':100,'zhangweiwei':200,'wangfeng':300}

In [17]:
obj3 = pd.Series(sdata)
print(obj3)

lizhi          100
wangfeng       300
zhangweiwei    200
dtype: int64

In [28]:
name = ['lizhi','zhangweiwei','python']
obj4 = pd.Series(sdata,index = name)
obj4

lizhi          100.0
zhangweiwei    200.0
python           NaN
dtype: float64

In [26]:
pd.isnull(obj4)

lizhi         False
zhangweiei     True
python         True
dtype: bool

In [27]:
pd.notnull(obj4)

lizhi          True
zhangweiei    False
python        False
dtype: bool

In [24]:
obj3+obj4

c++              NaN
lizhi          200.0
python           NaN
wangfeng         NaN
zhangweiwei      NaN
dtype: float64

In [29]:
obj4.name = 'singer'
obj4.index.name = 'blv'
obj4

blv
lizhi          100.0
zhangweiwei    200.0
python           NaN
Name: singer, dtype: float64

In [31]:
data = {'state':['ohio','ohio','ohio','nevada','nevada','nevada'],
       'year':[2000,2001,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002
5  3.2  nevada  2003

In [32]:
frame.head()

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002

In [37]:
pd.DataFrame(data,columns=['year','halo','pop'])

   year halo  pop
0  2000  NaN  1.5
1  2001  NaN  1.7
2  2002  NaN  3.6
3  2001  NaN  2.4
4  2002  NaN  2.9
5  2003  NaN  3.2

In [38]:
frame2 = pd.DataFrame(data,columns=['state','year','pop'],index=
                                    ['one','two','three','four','fivr','six'])
frame2

        state  year  pop
one      ohio  2000  1.5
two      ohio  2001  1.7
three    ohio  2002  3.6
four   nevada  2001  2.4
fivr   nevada  2002  2.9
six    nevada  2003  3.2

In [39]:
frame2.columns

Index(['state', 'year', 'pop'], dtype='object')

In [40]:
frame2.index

Index(['one', 'two', 'three', 'four', 'fivr', 'six'], dtype='object')

In [44]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
fivr     nevada
six      nevada
Name: state, dtype: object

In [45]:
frame2.loc['one']

state    ohio
year     2000
pop       1.5
Name: one, dtype: object

In [46]:
frame2['newcolumn'] = 'new'

In [47]:
frame2

        state  year  pop newcolumn
one      ohio  2000  1.5       new
two      ohio  2001  1.7       new
three    ohio  2002  3.6       new
four   nevada  2001  2.4       new
fivr   nevada  2002  2.9       new
six    nevada  2003  3.2       new

In [50]:
pop = {'nevada':{2001:24,2002:33},
       'inter':{2002:44,2003:67},
       'amd':{2004:12,2009:45}}
frame3 = pd.DataFrame(pop)
frame3

       amd  inter  nevada
2001   NaN    NaN    24.0
2002   NaN   44.0    33.0
2003   NaN   67.0     NaN
2004  12.0    NaN     NaN
2009  45.0    NaN     NaN

In [51]:
frame3.T

        2001  2002  2003  2004  2009
amd      NaN   NaN   NaN  12.0  45.0
inter    NaN  44.0  67.0   NaN   NaN
nevada  24.0  33.0   NaN   NaN   NaN

In [52]:
pdata = {'xlinx':frame3['amd'][:-1],
        'arm':frame3['inter'][:2]}
pd.DataFrame(pdata)

       arm  xlinx
2001   NaN    NaN
2002  44.0    NaN
2003   NaN    NaN
2004   NaN   12.0

In [53]:
frame3.index.name = 'year'
frame3.columns.name = 'company'
frame3

company   amd  inter  nevada
year
2001      NaN    NaN    24.0
2002      NaN   44.0    33.0
2003      NaN   67.0     NaN
2004     12.0    NaN     NaN
2009     45.0    NaN     NaN